#+STARTUP: indent contents
#+OPTIONS: num:nil toc:nil
*** Run the program
In order to run this you have to "tangle" the code first using =C-c
C-v C-t=.

#+BEGIN_SRC shell :tangle no :results output :exports both
  cd ada
  gnatmake day05
  ./day05
#+END_SRC

#+RESULTS:
: Advent of Code 2021 - Day 05
: The result for Part 1 is  4728
: The result for Part 2 is  17717
